{"meta":{"title":"明者如月","subtitle":"","description":"虚怀若谷，清气若兰","author":"yoke686","url":"http://example.com","root":"/"},"pages":[{"title":"分类","date":"2020-02-10T14:07:08.000Z","updated":"2022-12-13T06:07:18.985Z","comments":false,"path":"categories/index.html","permalink":"http://example.com/categories/index.html","excerpt":"","text":""},{"title":"资源","date":"2020-02-10T14:07:08.000Z","updated":"2022-10-31T07:00:50.095Z","comments":false,"path":"resources/index.html","permalink":"http://example.com/resources/index.html","excerpt":"","text":""},{"title":"关于","date":"2020-02-10T14:07:08.000Z","updated":"2022-12-13T06:07:48.770Z","comments":false,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":""},{"title":"标签","date":"2020-02-10T14:07:08.000Z","updated":"2022-12-13T06:06:15.271Z","comments":false,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"计算机网络作业","slug":"计算机网络作业","date":"2022-12-09T14:00:54.000Z","updated":"2022-12-09T14:02:11.275Z","comments":true,"path":"2022/12/09/计算机网络作业/","link":"","permalink":"http://example.com/2022/12/09/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C%E4%BD%9C%E4%B8%9A/","excerpt":"","text":"顾振亚2019053424","categories":[],"tags":[]},{"title":"2022年书单","slug":"2022年书单","date":"2022-12-01T04:32:25.000Z","updated":"2022-12-13T06:00:23.681Z","comments":true,"path":"2022/12/01/2022年书单/","link":"","permalink":"http://example.com/2022/12/01/2022%E5%B9%B4%E4%B9%A6%E5%8D%95/","excerpt":"","text":"2021年度书单一、文学名著首先是文学名著： 《许三观卖血记》余华 余华的文字朴实无华，但并非单调枯燥，就像流淌的蜂蜜，看余华的书从来不需要书签，这本书我也是一晚上就看完了。情节引人入胜，与《活着》相比，似乎技巧上更纯熟了，不过分渲染情绪，不发表任何议论，从不和读者讲大道理，不描写人物内心，小说的情节几乎全部由对话来推动，里面的人物又是多么的质朴——偷偷给被批斗的妻子做红烧肉的许三观，精打细算过生活的许玉兰，想吃面条而离家出走的一乐，不论是一元七角的面条，还是用嘴做的红烧肉，还是二两黄酒和猪肝，那个年代中国的老百姓真是太可爱也太苦了，真是太精明也太淳朴了，他们精打细算，尖酸刻薄，内心的愿望都只是想过个安稳日子，他们勾心斗角，以牙还牙，在大是大非上却从不逃避责任，该有担当的时候却毫不含糊，最后写道：他要在这六个地方上岸卖血，他要一路卖着血去上海，读到这里不由得让我心中一缩，眼前一黑，不详笼罩在了我的心头，但最后，余华宽容了，不同于《活着》的福贵悲惨、孤苦，《许三观卖血记》留给了我们一个温情的结局。读完整本书犹如刀尖舔蜜，却令人回味无穷…… 《兄弟》余华 一部有着50万字，650页的长篇巨著，书分为上下两部，故事的时间线是1965年到2005年，长达四十年。上部讲了”文革“时期的事情，余华认为，那是一个精神狂热、本能压抑和命运惨烈的年代，相当于欧洲的中世纪。这一部的内容，余华的叙述非常血腥非常残忍，我觉得非常荒诞的同时也觉得非常真实。下部讲了”改革开放“以及以后的事情，余华认为，这是一个伦理颠覆、浮躁纵欲和众生万象的时代，更甚于今天的欧洲了。下部的内容，余华的叙述非常浮夸非常滑稽，却让我觉得非常真实，但同时又觉得非常荒诞。 《文城》余华 这部作品写的很成熟，一点也不差，只是在《许三观》、《活着》、《兄弟》的光环下，略显平庸。 成熟在余华讲故事的技巧，一如既往的流畅、好读。 《文城》的故事是一开始一个男人娶了一个妻子，结果妻子跑了，男人南下寻妻，我带着好奇读了下去，然后军阀、土匪，清末民初的乱世到来了，就像鲁迅所说，兵和匪不相争，无枪的百姓却受兵匪之苦。然后书里的百姓，在这乱世下各个命运迥异。特别是匪患部分，写的异常残忍、暴力、悲惨，可以说是余华的长篇里最残忍的。故事是个好故事，然而一个好的文学作品，仅仅有一个好故事是不够的，我们喜欢一个文学作品，觉得一个文学作品优秀，要么是因为艺术性高，要么是因为有内涵思想深刻，要么是因为这个文学作品能唤醒我们生活中的经验等等。可惜《文城》都缺乏一些，我喜欢《活着》和《许三观》，都是因为里面的人物很可信，福贵那是真的苦，但是他随波逐流，依靠惯性活着。许三观有一些尖酸刻薄之类的小市民心态在，但是在大是大非上却绝对不含糊。总之这些人物的性格，他们作出的选择，都很可信。《文城》对于林祥福等几个主要角色的性格塑造弱了些，一个淳朴的地主，一个为民着想的乡绅，一个有情有义的兄弟，一堆忠心耿耿的仆人，还有几十个勇敢热血的民兵团，加上一堆脸谱化的市民，人物都太正面了。坏人就全是土匪，而且是坏到极致的那种，如那个张一斧，残暴不仁，杀人如麻，但是余华就一直写他做丧尽天良的事，对他的动机塑造的弱了点。 《在细雨中呼喊》余华 《在细雨中呼喊》是余华的首部长篇小说，它不同于余华的其它作品，像《活着》、《许三观卖血记》讲述的是一个接一个的苦难。不过之后让人痛彻心扉。相比之下，这是一部更令人寻味的作品。 《战栗》余华 收录了三个中篇小说，分别是《偶然事件》、《一个地主的死》、《战栗》。《偶然事件》这个小说讲了两场凶杀案的故事，我觉得一般，只是相对于其他的推理悬疑小说来说情节过于简单，看到一半就猜到结局。不过猜到结局又如何，这并不是推理小说。《偶然事件》在我看来有两处特别好，第一处余华对结构的探索，第二处是人物内心的刻画。这部作品的叙述，看起来没有重心，没有目的，就是陈河江飘两位主人公不停用书信往来，以此推进剧情，但是书信中的文字，充分展现了两人内心的发展，如陈河全程不用标点符号，语言疯疯癫癫，透露出了此人爱钻牛角尖，极度偏执的心态，陈河的内心状态刻画是我觉得整个故事里最抓人的地方，并且透过他的信，我们发现他一直站在自己的立场去解读第一场凶杀案，慢慢的陷入了思想的深渊之中，最后促成了第二件凶杀案发生，故事戛然而止，令人叹为观止，这是一部天才之作。 《一个地主的死》是发生在抗日战争时期的故事，叙述模式很有鲁迅的影子，日军残暴狠毒，革命者试图反抗，民众们却麻木不仁…当日军到处奸淫掳掠的时候，当王香火准备与一队日本兵同归于尽的时候，有人拿公羊和母猪交配，有人在茶馆津津乐道，有人在打情骂俏，有人在嫖娼泄欲…故事由粪坑开始，由粪坑结束，这是在隐喻什么呢？ 《战栗》一个喜欢用言语包装欲望的诗人伪装被层层褪去，最后战栗了，故事很有意思，至于这到底意味着什么，我目前还不太懂。 《六神磊磊读金庸》六神磊磊 有对金庸世界的宏观分析，也有无端的插科打诨，关于北宋到清朝以来武功的发展史是“缩阳史”的评价颇有启发性，也忽觉从“侠之大者，为国为民”走向“辣块妈妈”，何尝不是对理想武侠世界的告别与解构。与六神磊磊在好多问题上倒是见解统一，比如郭芙心里空的一块，不是杨过而是没有得到满足的虚荣心，但不得不说作者的文笔有时候还是油腻到让人想要脚趾扣地。总体来讲，认真对待的话觉得许多地方皆值得皱眉，当成消遣读物就很不错。 读这本书的经历给我一个前所未有的体会：微信公众号的文章与正式出版物的文章是不一样的。六神磊磊算是公众号文章写得极好了，但一旦集结出版、这么多文字摆放在一起，作者笔下的虚浮处和随手棋就暴露无遗。反过来讲，这也说明了本书该采取的读法：像公众号一样。置于枕边，每天看一两篇。自己一口气将其看完，是苛责了作者。 《越过人生的刀锋》六神磊磊 六神磊磊读金庸系列的第二本书。上一本的体验还不错，加之在公众号上看到他的推文，得知他刚刚又出了这本，于是顺手买了来，一小时匆匆翻完。坦白说，体验很是一般。如果说上一本书是一个资深书迷对金庸江湖的领悟，是对“侠之大者，为国为民”和“怜我世人，忧患实多”以及“从武侠理想主义到武侠现实主义”的精准抽象，那么这本书的格局顿时下降了不少，变成了对书中女性人物的吃瓜评论，并且很多人物在书中都是非常边缘的人物，存在感很低 ——并不是说边缘人物不能写，有不少配角虽然笔墨不多，但塑造得非常精彩，人物立得住，但符敏仪、甘宝宝、静慧这些人物也硬要拿来评述一番，实在有凑数之嫌。当然，某种程度上我也能够理解。虽然我们总是说“金庸宇宙”，但毕竟金先生累计只写了15部作品，作为一个主题来说，可供挖掘的题材其实是非常有限的。 小结：今年可以说是“余华”年了，看的7本书中有5本是余华的。六神磊磊的这类书籍还是当作睡前消遣读物为好。至此，除了《第七天》这本书没读过之外算是把余华的所有长篇全部读完了，可以给我心目中的余华长篇做个排序了：1：《活着》 2：《许三观卖血记》 3：《兄弟》 4：《在细雨中呼喊》 5：《文城》 二、网络文学这类书籍不过多赘述，学习之余的消遣。 历史类： 《家父汉高祖》 《葬元》 《唐人的餐桌》 《小阁老》 《绍宋》 《梦回大明春》 都市类： 《亏成首富从游戏开始》 《重生之似水流年》 《这不是娱乐》 《我是大玩家》 《苏灿的时光羁旅》 玄幻类： 《第一序列》 《夜的命名术》 《灵境行者》 《大王饶命》 仙侠类： 《光阴之外》 《择日飞升》","categories":[],"tags":[{"name":"书籍","slug":"书籍","permalink":"http://example.com/tags/%E4%B9%A6%E7%B1%8D/"}]},{"title":"费米能级","slug":"费米能级","date":"2022-11-05T12:35:23.000Z","updated":"2022-12-09T15:05:13.006Z","comments":true,"path":"2022/11/05/费米能级/","link":"","permalink":"http://example.com/2022/11/05/%E8%B4%B9%E7%B1%B3%E8%83%BD%E7%BA%A7/","excerpt":"","text":"关于费米能级(Fermi level)的不同理解——总结一、基本概念在大于0K时候，电子处于费米能级的几率是1&#x2F;2，但并不是说有一半电子位于费米能级之下，另一半数量的电子位于费米能级之上。而是电子能量低于费米能级的几率大于1&#x2F;2，而高于费米能级的几率小于1&#x2F;2，显然这意味着大多数电子优先排布于费米能级以下的位置，这就是为什么原子核外的电子优先占据内部能级的原因。固体物理和半导体物理在这方面的内容没有什么差别。原子核外的电子可以拥有的能量当然可以高于费米能级，只不过具有这种能量的几率很小而已。这也正是为什么本征半导体虽然电导很低，但也不是无穷小的原因。 费米能级不是一个真正存在的能级。它只是用于衡量一个系统的能级水平。 对于一个系统来说，处处的费米能级相同。对于两个系统合并成为一个系统，则费米能级也会趋于处处相同(会有净电荷的流动)。 费米能级描述了各个能级上电子分布的概率。 费米能级随着温度和掺杂浓度而变化。具体来说如下: a. 对于N型半导体费米能级在禁带中央以上；掺杂浓度越大，费米能级离禁带中央越远，越靠近导带底部。 b. 对于P型半导体费米能级在禁带中央以下；掺杂浓度越大，费米能级离禁带中央越远，越靠近价带顶部。 总结：当系统处于热平衡状态且不对外做功的情况下增加一个电子所引起系统自由能的变化等于系统的化学势也就是等于系统的费米能级即EF。费米能级表征电子的填充情况费米能级以上的量子态被电子占据的概率很小，费米能级以下量子态被电子占据的概率很大。同时费米能级也表征了半导体掺杂水平通常N型半导体掺杂越高费米能级越靠近导带P型半导体掺杂越高费米能级越靠近价带 。 二、问题1、在固体物理中老师讲费米能级是电子占据概率为0.5的能级位置，可是学习半导体物理时，发现费米能级常常在半导体的禁带中，大家知道禁带中电子是不能占据的，那为何电子占据概率为二分之一的费米能级会出现在禁带里面呢?答：费米能级(Fermi level)是绝对零度下电子的最高能级。根据泡利不相容原理，一个量子态不能容纳两个或两个以上的费米子(电子)，所以在绝对零度下，电子将从低到高依次填充各能级，除最高能级外均被填满，形成电子能态的“费米海”。“费米海”中每个电子的平均能量为(绝对零度下)为费米能级的3&#x2F;5。海平面即是费米能级。一般来说，费米能级对应态密度为0的地方，但对于绝缘体而言，费米能级就位于价带顶。成为优良电子导体的先决条件是费米能级与一个或更多的能带相交。 你那个说法是单纯从费米分布函数说的，没有考虑实际的物理体系。 什么是Fermi能级?为什么Fermi能级可以处于禁带中间?为什么本征半导体的Fermi能级位于禁带中央?为什么N型半导体的Fermi能级位于导带底附近?Fermi能级随着温度和掺杂浓度的改变而如何变化?Fermi能级(EF)是一个非常重要的物理概念，它在半导体电子学中起着极其重要的作用。(1)Fermi能级的概念:在固体物理学中,Fermi能量(Fermi energy)是表示在无相互作用的Fermi粒子的体系中加入一个粒子所引起的基态能量的最小可能增量；也就是在绝对零度时，处于基态的Fermi粒子体系的化学势，或者是处于基态的单个Fermi粒子所具有的最大能量——Fermi粒子所占据的最高能级的能量。另一方面，按照Fermi-Dirac统计，在能量为E的单电子量子态上的平均电子数为: 式中的 T 为绝对温度,k 为玻尔兹曼常数,EF 是该 Fermi-Dirac 分布函数的一个参量(称为化学势)。在绝对零度下，所有能量小于EF的量子态都被电子占据，而所有能量大于EF的量子态都是空着的，则作为化学势的参量EF就是电子所占据的最高量子态的能量，因此这时系统的化学势也就与费米能量一致。从而，往往就形象地把费米能量和化学势统称之为Fermi能级。虽然严格说来，费米能级是指无相互作 用的 Fermi粒子系统在趋于绝对零度时的化学势，但是在半导体物理电子学领域中，费米能级则经常被当做电子或空穴的化学势来使用，所以也就不再区分费米能级和化学势了。在非绝对零度时，电子可以占据高于EF的若干能级，则这时 Fermi 能级将是占据几率等于50%的能级。处于 Fermi 能级附近的电子(常称为传导电子)对固体的输运性质起着重要的作用。(2)Fermi能级的含义:作为Fermi-Dirac分布函数中一个重要参量的Fermi能级 EF，具有决定整个系统能量以及载流子分布的重要作用。①在半导体中，由于Fermi能级(化学势)不是真正的能级，即不一定是允许的单电子能级(即不一定是公有化状态的能量)，所以它可以像束缚状态的能级一样，可以处于能带的任何位置，当然也可以处于禁带之中。对于金属，其中的自由电子在k空间中将填充成一个球体，称为 Fermi 球; Fermi 能量也就是 Fermi 球面对应的能量，该能量可以采用 Fermi 球的半径——Fermi 半径 kF 来表示为 式中的h是Dirac常数,m 是自由电子的质量。因此，金属中的Fermi能级也就是导带中自由电子填充的最高能级。pF&#x3D;hkF称为 Fermi 动量,vF&#x3D;hkF&#x2F;m称为Fermi速度。一般，金属的 Fermi 能量约为1.5–15eV。对于绝缘体和半导体,Fermi能级则处于禁带中间。特别是本征半导体和绝缘体，因为它们的的价带是填满了价电子(占据几率为100%)、导带是完全空着的(占据几率为0%)，则它们的Fermi能级正好位于禁带中央(占据几率为50%)。即使温度升高时，本征激发而产生出了电子-空穴对，但由于导带中增加的电子数等于价带中减少的电子数，则禁带中央的能级仍然是占据几率为50%，所以本征半导体的Fermi能级的位置不随温度而变化，始终位于禁带中央。②Fermi能级实际上起到了衡量能级被电子占据的几率大小的一个标准的作用。在 E&lt;EF 时,f(E) &gt;1&#x2F;2；在 E&gt;EF 时,f(E)&lt;1&#x2F;2；在E&#x3D;EF时,f(E)&#x3D;1&#x2F;2。譬如，当(E–EF) &gt;5kT时,f(E)&lt; 0.07，即比 EF 高5kT 的能级被电子占据的几率只有0.7%。因此,EF的高低(位置)就反映了能带中的某个能级是否被电子所占据的情况。Fermi能级上电子占据的几率刚好为50%。在温度不很高时,EF以上的能级基本上是空着的(例如，导带就是如此，其中的自由电子很少),EF以下的能级基本上是被电子填满了的(例如，价带就填满了价电子，其中的自由空穴很少)；在 EF 以上、并越靠近EF(即E-EF越小)的能级，被电子所占据的几率就越大。对于N型半导体，因为导带中有较多的电子(多数载流子)，则Fermi能级EF必将靠近导带底(EC)；同时，掺入施主杂质的浓度越高，Fermi 能级就越靠近导带底。③上述分布函数f(E)是指电子占据能带(导带)中某个能级的几率(电子的能量越往上越高)。如果是讨论空穴载流子的话(空穴的能量越往下越高)，那么就应当是相应于价带中某个能级所空出(即没有被电子占据)的几率，所以空穴占据能带(价带)中某个能级的几率可以给出为 对于p型半导体，因为价带中有较多的自由空穴(多数载流子)，则Fermi能级EF在价带顶(EV)之上、并必将靠近EV；这时，价带中越是靠近EF的的能级，就被空穴占据的几率越大；同时，掺入受主的杂质浓度越高，Fermi能级就越靠近价带顶。总之，凡是EF靠近导带底的半导体必将是电子导电为主的n型半导体，凡是EF靠近价带顶的半导体必将是空穴导电为主的p型半导体。当然，如果EF处于禁带中央，即两种载流子分别占据导带能级和价带能级的几率相等，则两种载流子的数量也就差不多相等，那么这就必然是本征半导体，这时的Fermi能级特称为本征Fermi能级(用EFi表示，与禁带中央线Ei一致)。④由于Fermi-Dirac分布函数是载流子体系处于热平衡状态下的一种统计分布规律。因此，也只有在(热)平衡情况下才可采用此分布函数，并且也只有在这时Fermi能级才有意义。实际上，Fermi能级本来就是热平衡电子系统的一个热力学函数——化学势。由于在热平衡状态下整个系统具有统一的化学势，因此整个电子系统、即使是复杂的混合体系，在热平衡时也必将具有统一的一条Fermi能级。(3)Fermi能级与温度和掺杂的关系：①Si和GaAs半导体的Fermi能级与掺杂浓度的关系见图1 。对于N型半导体，因为掺入的施主越多，导带电子的浓度就越大，相应地少数载流子——空穴的浓度就越小，则Fermi能级也就越靠近导带底。对于p型半导体亦然，掺杂浓度越高，Fermi能级就越靠近价带顶。当掺杂浓度高到一定程度时，甚至Fermi能级还有可能进入到导带或者价带内部。②Si和GaAs半导体的Fermi能级与温度的关系亦见图2 。因为当温度升高到一定程度时，不管是n型半导体还是p型半导体，它们都将转变成为(高温)本征半导体。从而，半导体中Fermi 能级也将是随着温度的升高而逐渐趋近于禁带中央。即随着温度的升高，n型半导体的EF将降低，p型半导体的EF将上升。此外，在图1和图2中也示出了半导体的禁带宽度(Eg&#x3D;EC-EV)随着温度的变化状况。Si和GaAs等半导体的禁带宽度具有负的温度系数。","categories":[],"tags":[{"name":"物理","slug":"物理","permalink":"http://example.com/tags/%E7%89%A9%E7%90%86/"}]}],"categories":[],"tags":[{"name":"书籍","slug":"书籍","permalink":"http://example.com/tags/%E4%B9%A6%E7%B1%8D/"},{"name":"物理","slug":"物理","permalink":"http://example.com/tags/%E7%89%A9%E7%90%86/"}]}